# Структура квиза
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },

    {
        'question': ' Необходимо собрать и вывести все уникальные слова из строки рекламного текста. Какой из перечисленных типов данных Python подходит лучше всего?',
        'options': ['кортеж (tuple)', 'список (list)', 'множество (set)', 'словарь (dict)'],
        'correct_option': 2
    },
    {
        'question': 'Как вывести список методов и атрибутов объекта x?',
        'options': ['help(x)', 'info(x)', '?x', 'dir(x)'],
        'correct_option': 3
    },
    {
        'question': 'Магнус предал Императора?!',
        'options': ['Да', 'Возможно', 'Был вынужден сделать', 'Нет'],
        'correct_option': 2
    },
    {
        'question': 'Кому из богов Хаоса поклоняется Фулгрим',
        'options': ['Нургл', 'Тзинч', 'Кхорн', 'Слаанеш', 'Император человечества'],
        'correct_option': 3
    },
    {
        'question': 'Сколько было созданно примархов',
        'options': ['Кто это?!', '20+1', '20', '6',  '18'],
        'correct_option': 1
    },
    {
        'question': 'Вам понравились вопросы?',
        'options': ['Да'],
        'correct_option': 0
    },

    # Добавьте другие вопросы
]
